fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокРеализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
    
    ДлительнаяОперация = НачатьСозданиеРеализацийНаСервере();
    
    Если ДлительнаяОперация = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗавершениеСозданияРеализаций", ЭтотОбъект);
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.Интервал = 1;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
    
    Если Объект.Договоры.Количество() = 0 Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("Таблица договоров пуста. Сначала выполните создание реализаций.");
        Возврат;
    КонецЕсли;
    
    МассивРеализаций = Новый Массив;
    Для Каждого СтрокаДоговора Из Объект.Договоры Цикл
        Если ЗначениеЗаполнено(СтрокаДоговора.ДокРеализация) Тогда
            МассивРеализаций.Добавить(СтрокаДоговора.ДокРеализация);
        КонецЕсли;
    КонецЦикла;
    
    Если МассивРеализаций.Количество() = 0 Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("В таблице нет ссылок на созданные реализации.");
        Возврат;
    КонецЕсли;
    
    ТабличныйДокумент = СформироватьАктыНаСервере(МассивРеализаций);
    ТабличныйДокумент.Показать("Акт об оказанных услугах");
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьСозданиеРеализацийНаСервере()
    
    Если Не ЗначениеЗаполнено(Объект.Период) Тогда
        ОбщегоНазначения.СообщитьПользователю("Не заполнен период.");
        Возврат Неопределено;
    КонецЕсли;
    
     ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
        УникальныйИдентификатор,
        "Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_СоздатьРеализацииПоАбонентскимДоговорам",
        Объект.Период.ДатаНачала,
        Объект.Период.ДатаОкончания);
    
    Возврат ДлительнаяОперация;
    
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеСозданияРеализаций(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если Результат.Статус = "Ошибка" Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю(
            "Ошибка при создании реализаций: " + Результат.КраткоеПредставлениеОшибки);
        Возврат;
    КонецЕсли;
    
    Если Результат.Статус = "Выполнено" Тогда
        
        Если ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
            ДанныеРезультата = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
        Иначе
            ДанныеРезультата = Результат.Результат;
        КонецЕсли;
        
        ЗаполнитьТаблицуРезультатов(ДанныеРезультата);
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуРезультатов(ДанныеРезультата)
    
    Объект.Договоры.Очистить();
    
    Если ДанныеРезультата = Неопределено Или ДанныеРезультата.Количество() = 0 Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("По заданному периоду не найдено подходящих договоров.");
        Возврат;
    КонецЕсли;
    
    Для Каждого СтрокаДанных Из ДанныеРезультата Цикл
        НоваяСтрока = Объект.Договоры.Добавить();
        НоваяСтрока.Договор = СтрокаДанных.Договор;
        НоваяСтрока.ДокРеализация = СтрокаДанных.Реализация;
    КонецЦикла;
    
    Элементы.Договоры.Обновить();
    
КонецПроцедуры

&НаСервере
Функция СформироватьАктыНаСервере(МассивРеализаций)
    
    ТабличныйДокумент = ВКМ_ОбщийМодульВызовСервера.ВКМ_ПечатьАктаОбОказанныхУслугах(МассивРеализаций);
    Возврат ТабличныйДокумент;
    
КонецФункции

#КонецОбласти
